; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-99)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 - object)
 (:init 
    (arm-empty)
    (clear b14)
    (on b14 b10)
    (on b10 b25)
    (on b25 b1)
    (on b1 b13)
    (on-table b13)
    (clear b27)
    (on b27 b7)
    (on b7 b4)
    (on b4 b18)
    (on b18 b3)
    (on b3 b9)
    (on b9 b17)
    (on b17 b11)
    (on b11 b12)
    (on b12 b28)
    (on-table b28)
    (clear b26)
    (on b26 b5)
    (on b5 b22)
    (on b22 b24)
    (on-table b24)
    (clear b23)
    (on b23 b16)
    (on b16 b6)
    (on b6 b21)
    (on b21 b8)
    (on b8 b15)
    (on-table b15)
    (clear b20)
    (on b20 b29)
    (on b29 b2)
    (on b2 b19)
    (on-table b19))
 (:goal (and 
(on-table b5)
))
)

; plan
1. (unstack b26 b5)
   deleted: (on b26 b5) (clear b26) (arm-empty)
   added: (holding b26) (clear b5)
   goals met: 0 of 1
2. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 0 of 1
3. (unstack b5 b22)
   deleted: (on b5 b22) (clear b5) (arm-empty)
   added: (holding b5) (clear b22)
   goals met: 0 of 1
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 1
